# 다음 퀴즈를 수행하시오. ~ 11:45

### Q1. pandas 모듈을 pd로, numpy 모듈을 np로 불러오시오.

In [1]:
import pandas as pd
import numpy as np

### Q2. "class_scores.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [2]:
df = pd.read_csv("class_scores.csv")

### Q3. df의 첫 3개 row를 출력하시오

In [3]:
df.head(3)

   Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
0   10101      1     A      M    55       84       50         40       59
1   10102      1     A      M    29       94       41         87       57
2   10103      1     A      F    28       80       68         41      100

### Q4. df의 마지막 2개 row를 출력하시오

In [4]:
df.tail(2)

     Stu_ID  grade class gender  Math  English  Science  Marketing  Writing
598   30539      3     E      M    51       67       39         91       55
599   30540      3     E      M    76       29       80         91       66

### Q5. df의 차원을 확인하시오

In [5]:
df.ndim

2

### Q6. df의 row 개수를 확인하시오

In [6]:
len(df)

600

### Q7. df의 column 개수를 확인하시오

In [7]:
df.shape[1]

9

### Q8. df의 column 이름을 확인하시오

In [8]:
df.columns

Index(['Stu_ID', 'grade', 'class', 'gender', 'Math', 'English', 'Science',
       'Marketing', 'Writing'],
      dtype='object')

### Q9. 2학년의 학번, 학년, 성적 전체를 추출하여 df_sub 객체에 저장하시오.

* 풀이 1

In [10]:
df_sub = df.loc[df["grade"] == 2, ]
df_sub = df_sub.iloc[:, [0, 1, 4, 5, 6, 7, 8]]
df_sub.head(2)

     Stu_ID  grade  Math  English  Science  Marketing  Writing
200   20101      2    57       68       98         88       40
201   20102      2    94       33       32         44       90

* 풀이 2

In [11]:
df_sub = df.loc[df["grade"] == 2, ]
df_sub = df_sub.iloc[:, np.r_[:2, 4:9]]
df_sub.head(2)

     Stu_ID  grade  Math  English  Science  Marketing  Writing
200   20101      2    57       68       98         88       40
201   20102      2    94       33       32         44       90

* 풀이 3

In [13]:
np.r_[:2, 4:9]

array([0, 1, 4, 5, 6, 7, 8])

In [12]:
df_sub = df.loc[df["grade"] == 2, df.columns[np.r_[:2, 4:9]]]
df_sub.head(2)

     Stu_ID  grade  Math  English  Science  Marketing  Writing
200   20101      2    57       68       98         88       40
201   20102      2    94       33       32         44       90

### Q10. df_sub를 기준으로 학생 개개인의 성적 평균을 계산하고 학번과 같이 "score_avg.csv"로 저장하시오.

In [ ]:
df_sub.iloc[:2, 2:].mean(axis = 1)

In [ ]:
df_sub.loc[200:201, "Math":"Writing"].mean(axis = 1)

In [ ]:
df_sub_mean = pd.DataFrame({"Stu_ID": df_sub["Stu_ID"],
                            "score_mean": df_sub.iloc[:, 2:].mean(axis = 1)})
df_sub_mean.head(2)

In [ ]:
df_sub_mean.to_csv("score_avg.csv", index = False)

### Q11. df_sub를 기준으로 과목별 성적 최고점, 최저점, 표준편차를 계산하고 과목명과 함께 score_stat에 저장하시오.

In [27]:
score_max = df_sub.iloc[:, 2:].max()
score_min = df_sub.iloc[:, 2:].min()
score_std = df_sub.iloc[:, 2:].std()
score_std

Math         21.966154
English      20.638307
Science      23.344244
Marketing    22.021939
Writing      21.772637
dtype: float64

In [26]:
score_stat = pd.DataFrame({"subject": df_sub.columns[2:7],
                           "score_max": df_sub.iloc[:, 2:].max(),
                           "score_min": df_sub.iloc[:, 2:].min(),
                           "score_std": df_sub.iloc[:, 2:].std()})
score_stat

             subject  score_max  score_min  score_std
Math            Math        100         25  21.966154
English      English        100         25  20.638307
Science      Science        100         25  23.344244
Marketing  Marketing        100         25  22.021939
Writing      Writing        100         25  21.772637

### Q12. score_stat의 index를 0 ~ 4로 만드시오.

In [28]:
score_stat = score_stat.reset_index(drop = True)
score_stat

     subject  score_max  score_min  score_std
0       Math        100         25  21.966154
1    English        100         25  20.638307
2    Science        100         25  23.344244
3  Marketing        100         25  22.021939
4    Writing        100         25  21.772637

In [31]:
# score_stat.set_index("subject").transpose()
score_stat.set_index("subject").transpose().reset_index()

subject      index        Math     English     Science   Marketing     Writing
0        score_max  100.000000  100.000000  100.000000  100.000000  100.000000
1        score_min   25.000000   25.000000   25.000000   25.000000   25.000000
2        score_std   21.966154   20.638307   23.344244   22.021939   21.772637

### Q13. score_stat 객체를 "score_stat.csv"로 저장하시오.

In [ ]:
score_stat.to_csv("score_stat.csv", index = False)